# SetDashStyleName

## Description
Deprecated - will generate error. Use SetDashLineTypeName instead.

```pascal
FUNCTION SetDashStyleName(
				DashStyleIndex : INTEGER;
				DashStyleName  : STRING) : BOOLEAN;
```

```python

def vs.SetDashStyleName(DashStyleIndex, DashStyleName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|DashStyleIndex|INTEGER|The index of the dash style to be named.|
|DashStyleName|STRING|The new name of the dash style specified by the index.|

## Remarks
Deprecated - will generate error. Use SetDashLineTypeName instead. The dash style index no longer exists. Original description was: Sets the dash style name of the specified dash style index.<BR>
<BR>

## See Also
VS Functions:
SetDashLineTypeName

## Version
```diff
- SetDashStyleName is obsolete as of Vectorworks 2019
```

Availability: from Vectorworks 2011
## Category
* Object Names